{ "index": {
        "title": "Projekte",
        "preword": "Dies ist die Linkliste, die 'alternative Startseite' oder die 'Sitemap'. Diese Seite enthält jedoch auch externe Links. <br /> Sie liefert auch eine Beschreibung der Website, der aktiven Projekte und mir.",
        "description": "<h4><a name='website' class='anchor'></a>Website</h4>Diese Website nutzt Ihren Webstorage, wenn Ihr Browser dies unterstützt. Dies bemerken Sie am besten beim wechseln der Sprachen - Sie müssen nach dem Wechsel der Sprache den 'Erneuern'-Knopf drücken, um die neue Sprachdatei zu laden.<br />Diese Seite ist sehr aktuell und ich werde sie aktuell halten, um auch die relativ neuen <a target='_blank' href='http://www.w3schools.com/html/html5_intro.asp'>HTML 5</a> Technologien kennenzulernen. Auch Javascript ist relativ neu für mich, aber eine interessante Welt. Es ist keine 'sichere' Sprache, aber sie ist oftmals schöner Augenzucker (Eyecandy) und aktuell sogar nützlich (siehe <a target='_blank' href='http://dev.thoeni.me/peta/plugin.php?plugin=32'>Kartenplugin in Peta</a> und auch <a target='_blank' href='http://www.w3schools.com/html/html5_intro.asp'>HTML 5</a>). <br />Auf der anderen Seite mag ich 'ernst zu nehmenderen' und meistens <a target='_blank' href='https://de.wikipedia.org/wiki/Model_View_Controller'>MVC</a> und <a target='_blank' href='https://de.wikipedia.org/wiki/Objektorientierte_Programmierung'>objektorientieren Code</a>. Auf dieser Seite bekommen Sie eine Übersicht über die Projekte, welche ich programmiert habe. <span style='color: grey;'><h4><a name='security' class='anchor'></a>Kapitel Sicherheit/Websiten schützen</h4>PHP 5 & MySQL 4 - Der leichte Einstieg, Seite 309:<br />'Fragen Sie nach dem Zufallsprinzip nur bestimmte Zeichen des Passwortes ab: mal das erste und dritte Zeichen, mal das sechste und vierte.' Weiter unten: 'Wenn sie diese zusätzlichen Features integrieren, sind sie schon dicht an dem Verfahren das Banken für browserbasiertes Online-Banking verwenden.'</span><hr /> Logisch! Nein ernsthaft, Sicherheit ist ein wichtiges Thema, auf das man zwei Augen richten sollte. Zwei meiner Projekte haben bereits die Fähigkeit zur Verschlüsselung ihrer lokalen Daten. Das letzte Projekt ist in PHP geschrieben und enthält derzeit keine Verschlüsselung in der Datenbank - dies wird folgen, sobald ich Zeit und Ideen dafür finde. Es wird ähnlich implementiert wie in den vorangegangenen Projekten.<h4><a name='homeAbout' class='anchor'></a>Über mich</h4>Der letzte Teil ist <a href='index.html?s=\"about\"' onclick='changeContent(\"about\"); return false;'>Über mich</a>. Nach der Ausbildung arbeitete ich vor allem körperlich, da 4 Jahre lang, 8 Stunden am Tag Computer, zu viel Computer für mich war. Da ich 2014 einen Arbeitsunfall (Mittelfussbruch) erlitt, möchte ich mein momentanes Hobby wieder zum Beruf machen. Seit April bin ich auf <a target='_blank' href='http://github.com/skamster'>Github</a> wieder ziemlich aktiv!<br />Dieser Code soll als Beispiel dienen, wie ich programmieren kann. <br />Sie können diese Projekte frei (GPLv2) benutzen und ich bin glücklich, wenn jemand es forkt, Fehler meldet oder es ausprobiert.",
        "content": {
            "tryToxic": {
                "pLink": "tryToxic",
                "sLink": "https://github.com/skamster/tryToxic/",
                "dLink": "tryToxicDocs/index.html",
                "stable": "Der Kern befindet sich in der Alpha-Phase (offen für Veränderungen). Durch Änderungen an der API können Teile 'aufhören zu funktionieren'."
            },
            "jobManagement": {
                "pLink": "jobManagement",
                "sLink": "https://github.com/skamster/jobManagement/",
                "dLink": "jobManagementDocs/index.html",
                "stable": "Funktioniert stabil."
            },
            "Peta": {
                "pLink": "peta",
                "sLink": "https://github.com/skamster/Peta/",
                "dLink": "petaDocs/index.html",
                "stable": "Funktioniert stabil, benötigt noch ein paar grundlegende Features."
            },
            "MultiSms": {
                "pLink": "multisms",
                "sLink": "https://github.com/skamster/MultiSms/",
                "dLink": "petaDocs/index.html",
                "stable": "Funktioniert derzeit nicht, benötigt ein umschreiben von Python 2.7 auf 3.x."
            },
            "skamster.github.io": {
                "pLink": "skamster.github.io",
                "sLink": "https://github.com/skamster/skamster.github.io/",
                "dLink": "https://github.com/skamster/skamster.github.io/",
                "stable": "Fertig"
            }

        }
    },
    "tryToxic": {
        "title": "tryToxic",
        "preword": "tryToxic ist ein weiterer tox-api-client. Er ist in python 3 mit den Bibliotheken pyTox und pyQt geschrieben.",
        "description": "Die Geschichte von tryToxic ist eine kurze - es gab ein Binding von tox in Python und mein Interesse war gross genug. Die ersten Teile flossen in <a target='_blank' href='index.html?s=jobManagement'>jobManagement</a> ein, bis dieser teil als toxTry abgespalten wurde. Es ist nun sauber separiert und hat seinen Namen, da es sowieso nicht ein offizieller Client wird (stattdessen wird dies QtTox, geschrieben in C++) und experimenteller sein kann (python ist sehr leicht anpassbar).Was gibt es noch zu sagen? Es ist einfach designed, Sie sollten sich schnell einen Überblick verschaffen können, in den Funktionen, wie auch im Code.",
        "features": {
            "Lokale Verschlüsselung": "Lokalen Daten können verschlüsselt werden. Es stehen 8 verschiedene Algorithmen zur Verfügung und die Migration zu andern Algorithmen funktioniert fliessend.",
            "Gruppenchats": "Lade Menschen in Gruppenchats ein oder erstelle selbst welche.",
            "Loglevel einstellen": "Verändere das Loglevel im laufenden Betrieb.",
            "I18N": "Es ist für alle Sprachen vorbereitet und in Deutsch und Englisch übersetzt."
        },
        "bugs": {
            "Dateitransfer": "Das senden von Dateien schlägt fehl.",
            "Lokale Verschlüsselung (API)": "Die lokale Verschlüsselung vom \"Tox-core-Projekt\" wurde in eine eigene Bibliothek geschrieben, die (noch) nicht für Python verfügbar ist. Da ich eine Verschlüsselung der lokalen Daten bereitstellen möchte, arbeite ich an zwei neuen Methoden, um alle Arten von Dateien Ver- und Entschlüsseln zu können, was das Projekt in diesem Punkt unabhängig machen würde. Sehen Sie sich das Wiki, http://piratepad.net/fileEncryption (in Diaspora gepostet) und die Datei lib/cryptClass.py für Änderungen an und machen Sie mit, wenn Sie wollen (für's auditen, entwickeln, forken oder benutzen, wenn es funktioniert). Wenn die Methoden vom Tox-core-Projekt wieder verfügbar werden, können diese zum hardening ebenfalls verwendet werden. Ich werde auch die SQL-Daten-basierte Verschlüsselung nicht entfernen, es werden also mindestens zwei Algorithmen zur Verfügung stehen (nett wäre es, kombinierte Algorithmen auf beide Arten von Verschlüsselung zu verwenden)."
        },
        "pictures": {
            "initview": {
                "desc": "Initialansicht",
                "src": "images/tryToxicInit.png",
                "link": "images/tryToxicInit.png"
            },
            "detailcompanyview": {
                "desc": "Chatansicht in Deutsch",
                "src": "images/tryToxicChat.png",
                "link": "images/tryToxicChat.png"
            }
        }
    },
    "jobManagement": {
        "title": "jobManagement",
        "preword": "Semantische Job-Übersicht für Menschen, die für verschiedene Firmen arbeiten (z.B freelancer oder temporär). Geschrieben in python3 mit pyQt und pyCrypto.",
        "description": "Als ich mit der Arbeit als Stagehand begann, gab es oft eine unvertrauenswürdige Atmosphäre gegenüber einigen Firmen. So kam ich zu der Idee, eine Finanzverwaltung zu machen, um die Auszahlungen der Firmen zu überprüfen. Ich bin kein grosser Finanzkopf, aber es war und ist gut brauchbar. Es ist definitiv kein klassisches Finanzmanagement!",
        "features": {
            "Lokale Verschlüsselung": "Lokalen Daten können verschlüsselt werden. Es stehen 8 verschiedene Algorithmen zur Verfügung und die Migration zu anderen Algorithmen funktioniert fliessend.",
            "Verschiedene Firmen": "Das Programm ist optimiert auf die Erfassung verschiedener Firmen, die mehrere Jobs anbieten.",
            "Persönliche Finanzen":"Eine separierte Ansicht für eigene Finanzen, Darlehen und Schulden.",
            "Loglevel einstellen": "Verändern Sie das Loglevel im laufenden Betrieb.",
            "I18N": "Es ist für alle Sprachen vorbereitet und bereits in Deutsch und Englisch übersetzt."
        },
        "bugs": {
            "Chart": "Nicht wirklich ein Fehler, aber die grafischen Kurven könnten flexibler sein."
        },
        "pictures": {
            "initview": {
                "desc": "Initialansicht",
                "src": "images/jobManagementDataInit.png",
                "link": "images/jobManagementDataInit.png"
            },
            "detailcompanyview": {
                "desc": "Firmenansicht",
                "src": "images/jobManagementDetailComapnyView.png",
                "link": "images/jobManagementDetailComapnyView.png"
            }
        }
    },
    "multisms": {
        "title": "MultiSms",
        "description": "Der Name MultiSms ist an den ursprünlichen Namen Multimobile(widget) angelehnt. Die Idee war und ist, SMS auf einfache weise über verschiedene Anbieter senden zu können. Das Script macht die Abläufe, welche der Benutzer auf der Website machen müsste, automatisch. Ein Trick dabei ist die generelle Nutzung der <a href='https://docs.python.org/2/library/urllib2.html' target=\"_blank\">Urllib</a> - diese Bibliothek agiert wie ein Browser, mit dem kleinen Unterschied, dass sie jeweils effektiv nur die HTML-Seite anfordert, welche sich wiederum zur automatisierten Überprüfung des Resultats anbietet.",
        "preword": "Das Projekt ist schon sehr alt (29.11.2008) und war mein zweites Pythonprogramm. Es nutzt pyKde4 und python2, enthält ein KDE-Widget und eine eigene KDE-Oberfläche. Der Code tauchte vor kurzem auf einer älteren Festplatte wieder auf und bedarf daher einiger Pflege.",
        "features": {
            "Pluginsystem": "Das Programm kann mehrere Anbieter via Pluginsystem laden.",
            "Widget": "Das Projekt bietet ein Widget für die Plasma-Oberfläche (KDE).",
            "Oberfläche":"Das Programm enthält auch eine eigene, graphische Benutzerschnitstelle (GUI)."
        },
        "bugs": {
            "Alles!": "Benötigt ein komplettes Umschreiben auf python3."
        },
        "pictures": {}
    },
    "peta": {
        "title": "Peta",
        "description": "Der Name Peta kommt von PhpmETA. Es ist in PHP 5.3+ geschrieben und bedient sich Smarty (template/.tpl-files) und Dojo (Javascript). Einige Plugins nutzen auch jQuery. Die Idee hinter diesem Projekt ist, redundantes Schreiben von Code zu verhinden. Ein Hauptziel ist eine gute Struktur, in dem ein Administrator mit leichten PHP- (nicht zwingend), HTML- und CSS-Kentnissen (eigener Style und grundlegende Anordnungen von Elementen) schnell und unkompliziert seine Projekte realisieren kann. Das letztendliche Ziel ist eine Basis für jede Form von Anwendungen in möglichst jedem Szenario.",
        "preword": "Ich denke, jeder Webmaster kennt das ein wenig - wenn Sie ein wirklich tolles System brauchen wollen, brauchen Sie für mehrere Projekte mehrere Installationen. Wenn etwas gefixt werden muss, geschieht dies in jeder einzelnen Instanz/Installation. Die Idee hinter PhpmETA ist, redundantes (sich wiederholendes) schreiben von Code zu verhindern - grundsätzlich kannst du einen Blog, eine Gallery oder was auch immer, separiert, aber mit dem gleichen Code, erstellen (1x Blogplugin -> 99x Bloginstanzen mit verschiedenen Zugriffsrechten). Für Freunde, Familien oder Öffentlich - oder alles zusammen!",
        "features": {
            "Flexibles Pluginsystem": "Jedes Plugin kann eine bis n Instanzen erstellen.",
            "Flexibles Zugriffssystem": "Jeder Benutzer hat eine bis n Rollen. Jedes instanzierte Plugin hat eine bis n Rollen mit einem r/rw/admin-recht.",
            "MVC-Struktur": "Es sollte einfach sein, sich den Code anzueignen oder ein Plugin zu schreiben.",
            "Plugins": "<ul><li><a target='_blank' href='https://github.com/skamster/Peta/tree/master/plugins/osmapPlugin'>osmapPlugin</a> | <a target='_blank' href='http://www.openstreetmap.org'>Openstreetmap-Karten</a> mit POI-support</li><li><a target='_blank' href='https://github.com/skamster/Peta/tree/master/plugins/markdownSite'>mdSite</a> | <a target='_blank' href='https://de.wikipedia.org/wiki/Markdown'>markDown</a>-Websites</li><li><a target='_blank' href='https://github.com/skamster/Peta/blob/master/plugins/site/site.php'>site</a> | html-Websites</li><li><a target='_blank' href='https://github.com/skamster/Peta/blob/master/plugins/forum/forum.php'>forum</a> | Baumstrukturiertes Forum</li><li>Einige einfache Beispiele.</li></ul>",

            "Livedemo": "<a target='_blank' href='http://dev.thoeni.me/peta'>PETA Livedemo</a>"
        },
        "bugs": {
            "Verändern der Zugriffsrechte bei den Plugins": "Das setzen schlägt fehl. Lösung: Rolle vom Plugin entfernen und mit gewünschten Rechten hinzufügen",
            "Andere": "Nicht entdeckt"
        },
        "pictures": {}
    },
    "skamstergithubio": {
        "title": "skamster.github.io",
        "preword": "Die Website informiert über aktuelle Projekte und mich.",
        "description": "Was ist der Sinn dieser Website? Eine technische Demonstration, Beschreibung, Links und Bilder aller Ideen und Projekte schön gesammelt und dargestellt. Dies ist die Umsetzung dieser Idee. Wenn es eine Kundenwebsite oder eine Projektwebsite wäre, würde ich nie so viele Effekte verwenden. Aber hier kann dies als lustige Umsetzungsspielerei und, wie erwähnt, Demonstration meiner Fähigkeiten zugleich dienen. Die meisten Effekte sind nebenbei CSS 3 zu verdanken.",
        "features": {
            "Offlinespeicherung": "Die Seite nutzt Ihren <a target='_blank' href='http://www.w3schools.com/html/html5_intro.asp'>HTML 5</a>-Offlinespeicher, so dass Sie die Seite mit einem einigermassen aktuellen Browser auch ohne Internetverbindung neu laden und aufrufen können. Probieren Sie es aus!",
            "JSON-Datenabfrage": "Alle Daten werden mittels statischen JSON-Dateien geladen. Dies dient der Übersetzung.",
            "jQuery": "jQuery dient als Hauptbibliothek zur Animierung, des Ladens und Findens der Klassen",
            "Popup-Newsticker": "Ein Newsticker für meinen Github-Account.",
            "Verschiedene Tooltips und Aufklapp-Menüs": "Ich habe bewusst Aufklappvarianten mit jQuery (pop-up beim Github-Knopf und Ort mit bedienbarer Karte im Tooltip) und CSS (Hauptmenü, komplette Eigenentwicklung) erstellt.",
            "Verschiedene Stile": "Gehen sie zu Ansicht->Websiten-Stil und wählen sie z.B spaced oder serious aus. Auch die verschiedenen Effekte mit dem Inhaltsverzeichniss aber dem fixen Menü sind zur Demonstration bewusst so umgesetzt."
        },
        "bugs": {
            "<del>onTop-Knopf in Chrome und Opera</del>": "<del>Der Knopf bewegt sich in Chrome nicht. In Firefox funktioniert dies tadellos</del>"
        },
        "pictures": {}
    },
    "about": {
        "title": "Über mich",
        "timeline":"<p>Dies sind meine Erfahrungen, die Sie sich auch als <a id='timeline' href='#my-timeline' onclick='$(\"#my-timeline\").show()'>zeitliche Ansicht (Timeline)</a> ansehen können.</p>",
        "description": "Guten Tag,<br />dieser Abschnitt informiert Sie über meine bisherigen Erfahrungen und Teile meines persönlichen Lebens. Ich habe viele Dinge ausprobiert und habe meine Stärken vor allem beim programmieren, aber auch beim administrieren/supporten von Systemen entdeckt und habe meine Ausbildung als Applikationsentwickler abgeschlossen. Im Gegenzug würde ich mich nicht als Designer oder Hardware-Spezialist ausgeben.<br /> Nachfolgend finden Sie eine Liste meiner Erfahrungen - persönlichere Unterlagen (wie das Fähigkeitszeugnis) finden sie unter <a target='_blank' href='https://cloud.openmailbox.org/public.php?service=files&t=c514d2742dd7e8b05fa857986984131d'>diesem Link</a>, das Passwort verschicke ich mit der Bewerbung oder auf Anfrage.",
        "picture": "profile.png",
        "contact": {
            "Persönliche Daten":"<a href='https://cloud.openmailbox.org/public.php?service=files&t=c514d2742dd7e8b05fa857986984131d' target='_blank' >Passwortgeschützte Owncloud-Freigabe</a>.",
            "Xampp": "skamster@jabber.ccc.de",
            "E-Mail": "hersche@openmailbox.org",
            "Diaspora": "<a target='_blank' href='https://nerdpol.ch/u/hersche'>hersche@nerdpol.ch</a>",
            "Xing": "<a target='_blank' href='https://www.xing.com/profile/Vinzenz_Hersche'>Vinzenz Hersche</a>",
            "keybase.io": "<a target='_blank' href='https://keybase.io/hersche'>https://keybase.io/hersche</a>",
            "Umgebung":"<a target='_blank' href='http://tile.stamen.com/toner/#12/46.9407/7.4676' id='map'>Bern</a>"
        },
        "support": {
            "trans": "Referenzen",
            "desc": "Ich supporte die Computer verschiedener Menschen seit mehr als 6 Jahren mit Hilfe von Linux. Meistens nutze ich <a target='_blank' href='http://kubuntu.org'>Kubuntu</a>, manchmal auch Linux Mint, praktisch immer jedoch <a target='_blank' href='http://kde.org'>KDE</a>. Diese Menschen, aber auch die Firmen, bringen durch Ihre Aussagen eine \"externe\" Ansicht in diesen Teil.",
            "reference": {
                "Puzzle ITC":"Meine <a target='_blank' href='http://puzzle.ch'>Ausbildungsfirma</a> schrieb über mich: <h4>Fachkompetenz</h4>Dank seiner guten Auffassungsgabe und seinem Wissensdurst konnte sich Herr Hersche schnell in die verschiedenen Themenbereiche einarbeiten und verfügt heute über fundierte Fachkenntnisse. Mit Problemstellungen setzt er sich selbständig auseinander und erarbeitet jeweils eine gute Lösung.<h4>Methodenkompetenz</h4>Herr Hersche arbeitete von Beginn an sehr selbständig und ging geplant vor. Dazu setzte er verschiedene Arbeitstechniken ein und wählte mit Hilfe seines vernetzten Denkens jeweils die effizienteste Vorgehensweise aus. <h4>Sozialkompetenz</h4>Wir lernten Herr Hersche als vielseitig interessierten und engagierten Mitarbeiter kennen. Gegenüber Mitarbeitern, Kunden und Vorgesetzten kommuniziert er stets offen und ehrlich und nimmt andere Meinungen sowie Kritik gern entgegen. In Teamarbeiten, insbesondere mit anderen Lernenden, trug er einen grossen Teil zum jeweiligen Erfolg bei.",
                "Ines": "Aussage einer Person",
                "Christian": "eine andere Aussage.."
            }
        },
        "languages": {
            "trans": "Programmiersprachen",
            "PHP": {
                "desc": "Ich nutze diese Sprache nun schon sehr lange. Seit mit <a target='_blank' href='http://php.net'>PHP5</a> die OOP-Welt Standard in der Sprache ist, ist es schön, diese zu nutzen.",
                "frameworks": {
                    "<a target='_blank' href='http://smarty.net'>Smarty</a>": "Vorlagenframework; erlaubt eine klare Trennung von 'controller' und 'view' (<a target='_blank' href='http://de.wikipedia.org/wiki/Model_View_Controller'>MVC</a>)"
                }
            },
            "Python": {
                "desc": "<a target='_blank' href='https://python.org'>Python</a> lernte ich nach Java kennen, wurde jedoch sehr schnell süchtig nach dieser Sprache. Perfekte Möglichkeiten für sequentiellen, objektorientierten und modularen Code - und trozdem muss es mindestens schön dargestellt werden :)",
                "frameworks": {
                    "Urllib2": "<a target='_blank' href='https://docs.python.org/2/library/urllib2.html'>Dieses</a> nette Framework 'spricht' mit Websites, ohne dass es einen daemon braucht. Nur zum Feld gehen, Input rein und abschicken - in Python, nicht im Browser. Dadurch lässt sich viel automatisieren, egal ob der Betreiber der Website das wünscht oder nicht.",
                    "PyQt || PyKDE": "<a target='_blank' href='http://qt-project.org/'>Qt</a> ist eine sehr modulare Bibliothek für Anwendungsoberflächen (und mittlerweile einiges mehr). Sie ist einfach zu benutzen und arbeitet sehr stabil auf vielen Systemen.",
                    "PyTox": "<a target='_blank' href='https://github.com/aitjcize/PyTox'>PyTox</a> ist eine Schnittstelle zum Tox-core-projekt. Für weitere Informationen besuchen Sie <a target='_blank' href='http://tox.im'>tox.im</a>",
                    "PyCrypto": "<a target='_blank' href='https://www.dlitz.net/software/pycrypto/'>PyCrypto</a> unterstüzt viele Arten von Hashing, symmetrischer und asymmetrischer Verschlüsselung. Es wird von mir grundsätzlich zur Verschlüsselung des lokalen Speichers genutzt."
                }
            },
            "Java": {
                "desc": "Diese Sprache lernte ich in der Ausbildung. Die JVM enthält ein sehr grosses, eigenes Framework, was mir weniger gefällt (dies macht sie langsam). Sie ist strikt objektorientiert, was grossartig zum Lernen ist. Seit Android die letzten Jahre zu wachsen begonnen hat und Dalvik sehr optimiert wurde, wird die Sprache wieder interessant.",
                "frameworks": {
                    "Groovy & Grails": "Zu vergleichen mit <a target='_blank' href='http://de.wikipedia.org/wiki/Ruby_on_Rails'>RoR</a>, aber in Java. Groovy ist eine eigene Sprache, Grails ein Framework um schnell Webapplikationen entwickeln zu können."
                }
            },
            "Javascript": {
                "desc": "In der Vergangenheit war diese Sprache ein Beispiel dafür, warum man eine Seite lieber statisch macht. So viel Inkompatibilität zwischen Browsern! Heute hat dies sich diese Situation verändert, vieles ist Standard, es gibt mächtige JS-Frameworks und es gibt <a target='_blank' href='http://www.w3schools.com/html/html5_intro.asp'>HTML 5</a>. Sehen Sie sich den Code der Seite an ;)",
                "frameworks": {
                    "jQuery": "<a target='_blank' href='http://jquery.com/'>jQuery</a> ist eine sehr berühmte Bibliothek. Sie ist heutzutage schon fast Standard.",
                    "Dojo": "<a target='_blank' href='http://dojotoolkit.org/'>Dojo</a> is ein sehr grosses Framework mit Unterstüzung für vieles, z.B Ui, Parsen, Verarbeiten, Ajax und so weiter. 12Mb mit sehr erweitertem Zeug!",
                    "Leaflet": "<a target='_blank' href='http://leafletjs.com/'>Diese Bibliothek</a> ist sehr neu für mich. Sie ist perfekt, um google-ähnliche Karten (zumindest Zoom und POIs) darzustellen, basiert jedoch auf dem Openstreetmap-Projekt. Ich bevorzuge dieses Kartenmaterial, da es frei und oftmals detailierter ist."
                }
            }
        },
        "rlang":{
            "Deutsch":"Dies ist meine Muttersprache, welche ich in Wort und Schrift fliessend behersche.",
            "Englisch":"Englisch spreche und schreibe ich fliessend. Mein akzent ist hörbar. Die englische Übersetzung dieser Website komplett von mir. Durch den Kontakt mit Computern erlernte ich diese Sprache recht rasch.",
            "Französisch":"Stark eingeschränkt in Schrift und Vokabular - durch das hinzuziehen von Englisch diskuttiere ich gerne in dieser Sprache - oder probiere es zumindest."
        },
        "mobile": {
            "trans": "Mobil gehacktes",
            "dd-wrt": "Gebraucht auf einigen Siemens- und Lynksys-Routern",
            "Archos AV100":"Diesen alten <a target='_blank' href='http://www.gofurygo.de/av100.php'>'Multimedia'-Player</a> habe ich mit <a target='_blank' href='http://sourceforge.net/projects/linav/'>MediOS</a> gerooted.",
            "GTA02/Openmoko": "<a target='_blank' href='http://en.wikipedia.org/wiki/Neo_FreeRunner'>Mein erstes Smartphone</a> (400Mhz). Ich nutzte dieses für 3, relativ unstabile, Jahre. Am Schluss blieben zwei aktive Projekte. Zum einen <a target='_blank' href='http://shr-project.org/trac'>SHR</a>  (stable hybrid release), welches die <a target='_blank' href='http://en.wikipedia.org/wiki/Enlightenment_%28software%29'>E17-Fensterverwaltung</a> nutzte. Ich schrieb <a target='_blank' href='https://gist.github.com/skamster/10565527'>meine erste Gtk-Python-Anwendung</a> auf diesem System (v.a. da das SMS-Programm einen Bug hatte und ich meine SMS lesen wollte).<br />Auf der andern Seite nutzte ich vor allem <a target='_blank' href='http://qtmoko.sourceforge.net/'>QtMoko</a>, welches sehr stabil und schnell war (da es keinen Xorg-Server brauchte). <a target='_blank' href='http://qt-project.org/'>Qt</a> ist ql! <br />Jetzt gibt es seit einigen Jahren eine Hardwareaufrüstung namens <a target='_blank' href='http://projects.goldelico.com/p/gta04-main/'>GTA04</a>. Mit diesem Update wechselte auch die Firma (FIC&rarr;Goldelico). Aktuell bin ich im Besitz eines GTA04's.",
            "Sony Xperia": "Nachdem das GSM-Modem des Openmokos (GTA02) kaputt ging, kaufte ich mir ein <a target='_blank' href='http://en.wikipedia.org/wiki/Sony_Ericsson_Xperia_active'>Xperia Active</a>. Dieses ist <a target='_blank' href='http://en.wikipedia.org/wiki/IP_Code'>IP</a>67-'gesichert', mit einem um 600Mhz gesteigerten Prozessor (1Ghz Singlecore) - nice! Einfach zu rooten, ich habe dies auch für einige Kollegen gemacht. Es war die erste Erfahrung mit <a target='_blank' href='http://www.xda-developers.com/'>xda</a>. Nach nicht einem Jahr konnte ich keinen Anruf mehr tätigen, die Qualität war zu schlecht, egal welche Rom ich verwendete.",
            "Motorola": "Nach meinem Xperia ging ich zu 600Mhz zurück, ein billiges Motorola 'outdoor' Telefon, <a target='_blank' href='http://www.gsmarena.com/motorola_defy_mini_xt320-4375.php'>X320</a>. Dieses ist immer noch rootbar wenn man eine spanische Firmware flasht, nach dem Installieren des Bootloaders (ClockworkMod) jedoch abbricht. Nice, da das Handy einfach in den wirklichen Werkstand zurückgebracht werden kann (kein Garantieverlust). Kurz nachdem das Display brach, bekam ich gleich zwei neue HTC's geschenkt.",
            "HTC": "Ich bekam meine zwei HTC's gratis, als Geschenk von Freunden. Eines ist ein <a target='_blank' href='http://forum.xda-developers.com/htc-sensation/'>Sensation</a> (Dualcore, 1.2 Ghz), das Andere ein <a target='_blank' href='http://forum.xda-developers.com/htc-one-x'>One X</a> (Quadcore, 1.5Ghz). Dies ist eine massive Geschwindigkeitszunahme für mich! Das One X ist schneller als mein Laptop (2x1.86Ghz vs. the 4x1.5Ghz)! Genial, um Sachen zu testen und aktuell zu bleiben. Rooten funktioniert einfach über einen offiziellen Weg.",
            "Samsung": "Einige Freunde kauften sich ein Samsung Galaxy S4, wie auch die Mini-Version. Es wurde mir erlaubt, das Mini zu rooten. Funktioniert einfach per offiziellem Weg.",
            "IPhone": "Ich habe dem IPhone 4S eines Freundes den Bildschirm ausgewechselt.",
            "Sony PSP (2000er-Serie)": "Ich bekam diese als Geschenk für die IPhone-Reparatur. Ich habe das Gerät geupdated (6.60) und es mit einer permanenten Homebrew-Installation versehen, so, wie es sein sollte! Sehr gut, um alte NEOGEO-Spiele wiederzuentdecken (als Kind habe ich 'Metal-Slug' geliebt), aber es spielt auch PSP-Iso's wie gewöhnliche Discs. Ql!"
        },
        "hobbys": {
            "trans": "Andere Interessen",
            "Longboards": "Ich fahre nun seit rund 9 Jahren Long- und Slalomboards. Es ist mein bester Fahrrad-Ersatz und liebstes Fortbewegungsmittel.<br /><a style='display: inline;' class='gallerybox' data-fancybox-group='gallery' href='images/board.jpg' title='Boards an der Aare, Bern 2014' ><img src='images/board.jpg' style='width: 60%;'/></a>",
            "Fahrrad": "Das Fahrrad ist eine gute Basis für Reisen und Fahrradanhänger. Ich mag dies auch im I18N-Stil (international)",
            "12V-Systeme": "Meine eigene Elektronik basiert vollständig auf 12 Volt und wird von Solarzellen gespiesen. Ich brauche keinen Konvertierer auf 230 Volt!",
            "Holz": "Holz ist ein geniales Material um damit zu arbeiten. Es ist ein Thema, in dass ich mich nebenbei vertiefen möchte (z.B. eigene Möbel bauen)."
        },
        "oldjobs": {
            "trans": "Jobs zwischen der Ausbildung und jetzt",
            "description": "Als meine Ausbildung fertig war, wollte ich etwas anderes tun, als vor dem Bildschirm zu sitzen. Ich fand Temporärjobs im Bereich Bühnenbau für grosse Openairs und Konzerte. Die erste Firma, für die ich arbeitete, war über Creative Personal Nüssli. Diese Firma macht die Bühnen an sich - Gerüsten, Klettern, bis zu 12 Stunden Arbeit am Tag.<br /><div class='gallerytablediv'><table class='gallerytable'><tr><td><a class='gallerybox' data-fancybox-group='gallery' href='images/oldjob1.jpg' title='Aufbau der Hauptbühne des Paléo, Nyon 2012' ><img src='images/oldjob1.jpg'></img></a></td><td><a class='gallerybox' data-fancybox-group='gallery' href='images/oldjob2.jpg' title='Aufbgebaute Hauptbühne des Paléo, Nyon 2012' ><img src='images/oldjob2.jpg' ></img></a></td></tr></table></div><br />Danach arbeitete ich für die Röck'n'Röll-Crew, wie auch für Epos. Dort verschob sich die Arbeit eher in Richtung Stagehand - Boxen aufstellen, LED-Wände zusammenhängen, Böden verlegen, Lastwagen ein- und ausladen (Robbie Williams: 10 Stück) und vieles mehr. Ich war auf der Bühne mit Nine Inch Nails, um die LEDs zu verschieben. Ich habe Bühnen für Muse und Bligg mitaufgebaut. Auch wenn ich nicht direkt ein Fan dieser (und einiger anderer) Artisten bin, ist es interessant und erfüllend, auch diese Welt zu sehen.<br /><div class='gallerytablediv'><table class='gallerytable'><tr> <td><a class='gallerybox' data-fancybox-group='gallery' href='images/oldjob6.jpg' title='Aufbau einer Rampe für das Redbull crushed Ice, Lausanne 2013' ><img src='images/oldjob6.jpg'></img></a></td><td><a class='gallerybox' data-fancybox-group='gallery' href='images/oldjob3.jpg' title='Aufbau Muse, Stadte de Suisse, Bern 2013' ><img src='images/oldjob3.jpg' /></a></td><td><a class='gallerybox' data-fancybox-group='gallery' href='images/oldjob4.jpg' title='Muse in Aktion (Backstageperspektive), Stadte de suisse, Bern 2013' ><img src='images/oldjob4.jpg' ></img></a></td><td><a class='gallerybox' data-fancybox-group='gallery' href='images/oldjob5.jpg' title='PuBligg-Tour, Luzern 2014' ><img src='images/oldjob5.jpg'></img></a></td><td><a class='gallerybox' data-fancybox-group='gallery' href='images/oldjob7.jpg' title='Licht und Bühnentest bei den Swiss music awards, Zürich 2014' ><img src='images/oldjob7.jpg'></img></a></td><td><a class='gallerybox' data-fancybox-group='gallery' href='images/oldjob8.jpg' title='Mobile Bühne an der Streetparade, Zürich 2012' ><img src='images/oldjob8.jpg'></img></a></td></tr></table></div> Bei diesen Firmen habe ich auch gute Arbeitschancen (ich bekomme Anfragen), allerdings möchte ich mir aufgrund eines Arbeitsunfalls (Mittelfussbruch) und meinen Interessen mindestens eine längere Auszeit nehmen."

        },
        "sys": {
            "trans": "Systemadministrator-Erfahrungen",
            "Windows 3.1": "Mein erster Computer. Er hatte 486hz und eine Harddisk mit 20Mb. <a target='_blank' href='https://de.wikipedia.org/wiki/Microsoft_Windows_3.1'>Windows 3.1</a> brauchte rund 20 Disketten zum Aufsetzen. Dies war auch das erste Gerät, das ich auseinandernahm und wieder zusammensetzte.",
            "Windows 95-Xp": "Dies waren meine folgenden Computer. Von meinem ersten 4x-CD-Laufwerk bis zum ersten CD-Brenner. Ich machte viele Erfahrungen, wovon nicht wenige mühsam waren.",
            "Mandrivia Linux": "<a target='_blank' href='https://de.wikipedia.org/wiki/Mandriva_Linux'>Mandrake/Mandrivia</a> war mein erstes, richtig gebrauchtes Linux. Es war ein wenig wie Kubuntu heute.",
            "OpenSuse": "Als dieses Projekt startete, schien es interessant (aufgrund der Einfachheit) - aber persönlich habe ich zu viele Fehler miterlebt. Heute hat sich dies wahrscheinlich auch geändert, allerdings benutze ich OpenSuse nicht mehr.",
            "Gentoo": "Nachdem ich ein wenig mit Linux spielte, Dualboot und solche Dinge hinter mich gebracht hatte, probierte ich <a target='_blank' href='https://de.wikipedia.org/wiki/Gentoo_Linux'>Gentoo</a> aus. Das war kurz vor meiner Ausbildung. In der Ausbildung hatten wir einen Lehrer, welcher auch Gentoo-Benutzer war. Es war mir deshalb erlaubt, eine <a target='_blank' href='https://de.wikipedia.org/wiki/Gentoo_Linux'>Gentoo</a>-Installation als Standardsystem zu nutzen. Ein bisschen stolz bin ich schon: Die Meisten kamen nie über einen Kernel-Panic hinaus, fühlten sich aber auch glücklich, als sie zu Windows XP zurückkehren durften. Dies ist meine Lieblingsdistribution!",
            "Fedora": "In meiner Ausbildungsfirma brauchten wir grundsätzlich <a target='_blank' href='https://de.wikipedia.org/wiki/Fedora_%28Linux-Distribution%29'>Fedora</a> (Communityfork von <a target='_blank' href='https://de.wikipedia.org/wiki/Red_Hat'>Red Hat</a>). Ich mochte dies nicht besonders (u.a. da das rpm-System recht RAM-hungrig war) und wechselte zu Gentoo.",
            "Kubuntu": "Da <a target='_blank' href='https://de.wikipedia.org/wiki/Gentoo_Linux'>Gentoo</a> zu unstabil lief (mh, experimentelle Repos und Spielereien...), wechselte ich zu <a target='_blank' href='http://kubuntu.org'>Kubuntu</a>. <a target='_blank' href='http://kubuntu.org'>Kubuntu</a>, da ich <a hfre='http://kde.org'>KDE</a> seit der Version 3 nutze. Mit dieser <a target='_blank' href='http://de.wikipedia.org/wiki/Distribution_%28Software%29'>Distribution</a> supporte ich viele Benutzer, die zu Linux wechseln wollen.",
            "CentOS": "Für die Server in der Ausbildungsfirma wurde <a target='_blank' href='http://de.wikipedia.org/wiki/CentOS'>CentOS</a> genutzt. Grundsätzlich ist meine Ausbildung auf die Applikationsentwicklung ausgelegt, ich hatte jedoch die Möglichkeit, einige Wochen bei den Systemadministratoren zu arbeiten. Wir bekamen auch einen 'Spielserver' pro Mitarbeiter zur Verfügung gestellt. Diese hatten 512MB RAM. Meine Dienste waren:",
            "centossub": {
                "XMPP/Jabber": "<a target='_blank' href='https://de.wikipedia.org/wiki/Openfire'>Openfire</a>, ein Java-basierter <a target='_blank' href='https://de.wikipedia.org/wiki/Extensible_Messaging_and_Presence_Protocol'>Jabberserver</a>. Wegen der enormen Speicherauslastung wechselte ich später zu <a target='_blank' href='https://de.wikipedia.org/wiki/Ejabberd'>Ejabberd</a>.",
                "E-Mail": "<a target='_blank' href='https://de.wikipedia.org/wiki/Sendmail'>Sendmail</a> und <a target='_blank' href='https://de.wikipedia.org/wiki/Dovecot'>Dovecot</a>. Wie einige Systemadministratoren sagen: \"Wer es nie konfiguriert hat, ist kein richtiger Linux-Admin – wer es zwei mal tut, ist verrückt!\".",
                "Tor-Node": "Ein einfacher <a target='_blank' href='https://de.wikipedia.org/wiki/Tor_%28Netzwerk%29'>Tor-Knotenpunkt</a>",
                "Apache": "Ein <a target='_blank' href='https://de.wikipedia.org/wiki/Apache_HTTP_Server'>Webserver</a> mit Ruby & Rails und PHP-Support.",
                "MySQL": "Eine <a target='_blank' href='http://de.wikipedia.org/wiki/SQL'>SQL</a>-Datenbank, die sehr verbreitet ist. ",
                "Squid": "Ein <a target='_blank' href='http://de.wikipedia.org/wiki/Squid'>Cache-Proxyserver</a>",
                "Diaspora": "Dies ist ein <a target='_blank' href='https://de.wikipedia.org/wiki/Diaspora_%28Software%29'>soziales Netzwerk</a>, das quasi wie E-Mail (<a target='_blank' href='https://de.wikipedia.org/wiki/Peer-to-Peer'>P2P</a>) funktioniert. Das Projekt lief über Apache (<a target='_blank' href='http://de.wikipedia.org/wiki/Ruby_on_Rails'>Ruby on Rails</a>). Da ich Probleme mit meinen selbstsignierten Zertifikaten und nicht immer Zeit zur Pflege hatte, war dieses Projekt leider oft unstabil.",
                "Seeks": "Eine <a target='_blank' href='https://en.wikipedia.org/wiki/Seeks'>P2P-Suchmaschine</a>, die Resultate von Google, Stackoverflow, Duckduckgo, Wikipedia oder was auch immer abfragen kann. Heute gibt es einen <a target='_blank' href='http://de.wikipedia.org/wiki/Abspaltung_%28Softwareentwicklung%29'>Fork</a>, genannt <a target='_blank' href='https://github.com/asciimoo/searx'>Searx</a>.",
                "Mozilla Weave":"Dieses Projekt war experimentell (aber funktionierte) und heisst heute <a target='_blank' href='http://de.wikipedia.org/wiki/Firefox_Sync'>Firefox Sync</a>.",
                "Etherpad-lite":"Ein <a target='_blank' href='http://de.wikipedia.org/wiki/EtherPad#EtherPad_Lite'>Web-Editor</a>, der Textbearbeitung in Echtzeit mit mehreren Menschen möglich macht.",
                "Hosting":"Ich habe in dieser Serverzeit bis zu 7 Websites gehosted."
            },
            "Debian": "Ich brauchte <a target='_blank' href='http://debian.org'>Debian</a> auf meinem neueren Server nach der Ausbildung, für etwa ein Jahr. <a target='_blank' href='http://debian.org'>Debian</a> war auch die Basis für <a target='_blank' href='http://qtmoko.sourceforge.net/'>QtMoko</a> (siehe Mobile hacks/Openmoko). Es wird oft gebraucht und eine Basis für viele <a target='_blank' href='http://de.wikipedia.org/wiki/Distribution_%28Software%29'>Distributionen</a>. Ich kenne <a target='_blank' href='http://de.wikipedia.org/wiki/Advanced_Packaging_Tool'>Apt</a>  besser von Kubuntu als Debian selbst. Mein zweiter Server basierte ebenfalls auf <a target='_blank' href='http://debian.org'>Debian</a> und stellte die gleichen Dienste wesentlich stabiler zur Verfügung - Debian ist schlicht besser supportet.",
            "Sabayon": "Eine schöne, auf Gentoo basierende Distribution. Da dieses System im gegensatz zu Gentoo mit binären Packeten arbeitet, sind die Möglichkeiten beschränkter.",
            "Arch Linux":"Da Sabayon nicht so konfigurierbar ist wie Gentoo, wechselte ich nun zu Arch, was durch die Kombination aus binären und quelltext-basierten Packeten ein gutes Hybrid-System ist."

        }
    },
    "transl": {
        "features": "Fähigkeiten",
        "bugs": "Fehler",
        "pictures": "Bilder",
        "description": "Beschreibung",
        "stability": "Stabilität",
        "projectname": "Projektname",
        "source": "Quelltext",
        "doc": "Doku",
        "table": "Linktabelle",
        "refresh": "Erneuern",
        "nowebstorage": "kein Offlinespeichersupport",
        "fromstorage": "Offlinespeicher",
        "fromnew": "Web",
        "lang":"de",
        "expiriences":"Erfahrungen",
        "security":"Sicherheit",
        "about":"Über mich",
        "mobilephonehint":"Ihr Browser scheint auf einem Handy oder Tablet zu laufen - kippen Sie das Gerät in das Querformat/den Landscape-Modus, um die Seite in optimaler Form geniessen zu können.",
        "reallang":"Gesprochene Sprachen",
        "impressum":"Impressum: Der ganze Inhalt ist von mir (mit Ausnahme markierter Bibliotheken und Bildern in der Timeline) - meine Werke stehen unter der <a href='gpl-2.0.txt' id='gpl' target='_blank'>GPLv2-Lizenz</a>."
    }
}