{
    "index": {
        "title": "Linkliste + über die Seite and Projekte",
		"preword":"Dies ist die Linkliste, das 'alternative' home oder die Sitemap. Diese Seite enthält jedoch auch externe Links. <br /> Sie enthält auch eine Beschreibung der Website und der aktiven Projekte.",
        "description": "TEXT IST AM ENSTEHEN - BETAALPHASUPEREXPERIMENTEL!! Dies ist eine kleine Linksammlung.<br />Diese und die ganze Seite nutzen deinen Webstorage, wenn dein Browser dies unterstüzt. <br />Diese Seite ist sehr aktuell und ich werde sie aktuell halten, um auch etwas über die relativ neuen HTML 5 Technologien zu lernen. Auch javascript ist recht neu für mich, aber eine lustige Welt. Es ist keine 'sichere' Sprache, aber sie ist lustig und manchmal sogar nützlich (siehe Kartenplugin in Peta). <br />Auf der anderen Seite mag ich ernst zu nehmenderen und meistens MVC und objektorientieren Code. Auf dieser Seite bekommen sie eine Übersicht über die Projekte, welche daraus enstanden sind. Ich sehe einen wichtigen Punkt in den Programmen, die ich schreibe. Deshalb haben 2 meiner Projekte bereits die Fähigkeit zur Verschlüsselung ihrer lokalen Daten. Das letzte Projekt ist in PHP geschrieben und enthält derzeit keine Verschlüsselung in der Datenbank - dies wird folgen, sobald ich Zeit und Ideen dafür finde. Es wird ähnlich implementiert wie in den vorangegangenen Projekten.<br /> Der letzte Teil ist über mich.Ich würde gerne etwas verdienen und habe diese Tätigkeit auch gelernt. Nach der Ausbildung arbeitete ich vor allem körperlich, da 4 Jahre lang, 8 Stunden am Tag Computer zu viel waren. Nun habe ich meinen Fuss gebrochen und wollte etwas tun - ich habe nie wirklich aufgehört zu programmieren (nur viel reduziert), aber seit April bin ich, wie sie auf github sehen können, wieder ziemlich aktiv!Ich will keine Spenden, dies soll als Beispiel dienen, wie ich programmieren kann. Sie können diese Projekte frei benutzen und ich bin glücklich, wenn jemand es forkt oder einen Teil dazu beiträgt.<br />Auch gemeldete Fehler sind super (dann merke ich, dass es benutzt wird :) )" 
        ,
        "content": {
            "tryToxic": {
                "pLink": "index.html?s=tryToxic",
                "sLink": "https://github.com/skamster/tryToxics/",
                "dLink": "tryToxicDocs/index.html",
                "stable": "ein wenig unsicher, da sich die API des Kerns schnell verändern kann"
            },
            "jobManagement": {
                "pLink": "index.html?s=jobManagement",
                "sLink": "https://github.com/skamster/jobManagement/",
                "dLink": "jobManagementDocs/index.html",
                "stable": "sollte funktionieren, derzeit pausiert"
            },
            "peta": {
                "pLink": "index.html?s=peta",
                "sLink": "https://github.com/skamster/Peta/",
                "dLink": "petaDocs/index.html",
                "stable": "Grundsätzlich bereit"
            }

        }
    },
    "tryToxic": {
        "title": "tryToxic",
        "preword": "tryToxic ist einfach ein weiterer tox-api-client. Er ist in python3 und pyQt geschrieben.",
        "description": "Die Geschichte von tryToxic ist eine kurze - es gab ein Binding von tox in Python und mein Interesse war gross genug. Meine ersten Teile flossen in <a href='index.html?s=jobManagement'>jobManagement</a>, genannt toxTry. Es ist nun sauber separiert und hat seinen Namen, da es sowieso nicht ein offizieller Client wird (stattdessen wird dies QtTox, geschrieben in C++).Was gibt es noch zu sagen? Es ist einfach designed, Sie sollten sich schnell einen Überlich verschaffen können..",
        "features": {
            "Lokale Verschlüsselung": "Speichere Nachrichten und Idendität verschlüsselt auf der Festplatte",
            "Gruppenchates": "Lade leute in welche ein oder kreire selbst welche",
            "Loglevel einstellen": "Verändere das Loglevel im laufenden Betrieb.",
            "I18N": "Es ist für alle Sprachen vorbereitet"
        },
        "bugs": {
            "Dateitransfer": "Senden schlägt fehl"
        },
        "pictures": {
            "initview": {
                "desc": "Initialansicht",
                "src": "images/tryToxicInit.png",
                "link": "http://www.imghack.se/155968"
            },
            "detailcompanyview": {
                "desc": "Chatansicht in Deutsch",
                "src": "images/tryToxicChat.png",
                "link": "http://www.imghack.se/155969"
            }
        }
    },
    "jobManagement": {
        "title": "jobManagement",
        "preword": "Semantische Job-übersicht wenn du für verschiedene Firmen arbeitest (z.B freelancer oder temporär).Geschrieben in python3 mit pyQt und pyCrypto.",
        "description": "a further description",
        "features": {
            "Lokale Verschlüsselung": "Alle Daten können lokal verschlüsselt werden",
            "Verschiedene Firmen": "When you work for diffrent companys",
            "Loglevel einstellen": "Verändere das Loglevel im laufenden Betrieb.",
            "I18N": "Es ist für alle Sprachen vorbereitet"
        },
        "bugs": {
            "Filetransfer": "Sending fails",
            "...": "etcetc"
        },
        "pictures": {
            "initview": {
                "desc": "Initialansicht",
                "src": "images/jobManagementDataInit.png",
                "link": "images/jobManagementDataInit.png"
            },
            "detailcompanyview": {
                "desc": "Firmenansicht",
                "src": "images/jobManagementDetailComapnyView.png",
                "link": "images/jobManagementDetailComapnyView.png"
            }
        }
    },
    "peta": {
        "title": "Peta",
        "preword": "Der Name Peta kommt von PhpmETA. Es ist vor allem in PHP 5.5 geschrieben und bedient sich smarty (template/.tpl-files) und dojo (Javascript). Die Idee hinter diesem Projekt ist, redundantes schreiben von Code zu verhinden. Ein Hauptziel ist eine gute Struktur, in dem ein Administrator schnell und unkompliziert arbeiten kann.. Das letztendliche Ziel ist eine Basis für alles.",
        "description": "Ich denke, jeder Webmaster kennt das ein wenig - wenn du ein wirklich tolles System brauchen willst, musst du SystemE brauchen (z.B mehrere Wordpresses). Wenn du etwas fixen musst, tust du das in jeder einzelnen Instanz/Installation. Meine idee ist, redundantes (sich wiederholendes) schreiben zu verhindern - grundsätzlich kannst du einen Blog, eine Gallery oder was auch immer, separiert, aber der gleiche Code, erstellen. Für Freunde, Familien und Öffentlich - oder alles zusammen!",
        "features": {
            "Flexibles Pluginsystem": "Jedes Plugin kann eine bis n Instanzen erstellen",
            "Flexibles Zugriffssystem": "Jeder Benutzer hat eine bis n Rollen. Jedes instanzierte Plugin hat eine bis n Rollen mit einem r/rw/admin-recht.",
            "MVC-Struktur": "Es sollte einfach sein, sich den Code anzueignen oder ein Plugin zu schreiben.",
            "Livedemo": "<a href='http://dev.thoeni.me/peta'>PETA LIVEDEMO</a>"
        },
        "bugs": {
            "Update accessrights": "Set ar fails on update, so rm ant touch!",
            "...": "etcetc"
        },
        "pictures": {
            "php": {
                "desc": "Powered by PHP",
                "src": "http://www.php.net/images/logos/php-power-black.gif",
                "link": "http://www.php.net/"
            }
        }
    },

    "about": {
	"title":"Über mich",
        "description": "Hallo, ich bin auch Entwickler ;) <br /> Wie Sie auf dieser Website sehen können, habe ich einige Erfahrungen in computerbezogenen Themen. Hier finden Sie persönlichere Informationen über mich.",
        "picture": "profile.jpg",
        "contact": {
            "Xampp": "skamster@jabber.ccc.de",
            "E-Mail": "hersche@vmail.me",
            "Diaspora": "<a href='https://nerdpol.ch/u/hersche'>hersche@nerdpol.ch</a>"
        },
        "languages": {
            "<a href='http://php.net'>PHP</a>": {
                "desc": "Nutze diese Sprache nun schon sehr lange. Seit mit PHP5 die OOP-Welt Standart in der Sprache ist, ist es schön, diese nutzen zu können.",
                "frameworks": {
                    "<a href='http://smarty.net'>Smarty</a>": "Vorlagenframework, erlaubt eine klare Trennung von 'controller' und 'view' (<a href='http://de.wikipedia.org/wiki/Model_View_Controller'>MVC</a>)"
                }
            },
            "Python": {
                "desc": "Python ist ein bischen eine neuere Sprache, die ich lernte, aber sie machte sehr schnell süchtig.Perfekte Möglichkeiten für sequentiellen, objektorientierten und modularen Code.",
                "frameworks": {
                    "PyQt": "Qt ist eine sehr modulare UI-Bibliothek. Sie ist einfach zu benutzen und arbeitet sehr stabil.",
                    "PyTox": "PyTox ist eine Schnittstelle zum Tox-core-projekt. Für weitere Informationen besuchen Sie <a href='http://tox.im'>tox.im</a>",
                    "PyCrypto": "PyCrypto unterstüzt viele Arten von Hashing, symetrischer und asymetrischer Verschlüsselung. Es wird von mir grundsätzlich zur Verschlüsselung des lokalen Speichers genutzt."
                } },
                "Java": {
                    "desc": "Diese Sprache lernte ich vor allem in der Ausbildung. Die JVM war oder ist ziemlich vollgestopft, was mir weniger gefällt. Sie ist strikt objektorientiert, was grossartig zum lernen ist. Seit Android die letzten Jahre zu wachsen begonnen hat und Dalvik sehr optimiert ist, wird die Sprache wieder interessant.",
                    "frameworks": {
                        "Groovy & Grails": "Zu vergleichen mit Ruby & Rails, aber in Java. Groovy ist eine eigene Sprache, Grails ein framework um schnell Webapplikationen entwickeln zu können."
                    }
                },
                "Javascript": {
                    "desc": "In der Vergangenheit war diese Sprache ein Beispiel dafür, warum man eine Seite lieber statisch macht. So viel inkompatibilität zwischen Browsern! Heute hat dies gewechselt, vieles ist Standart, es gibt mächtige JS-Frameworks und es gibt Html 5. Sehen Sie sich den Code der Seite an ;)",
                    "frameworks": {
                        "jQuery": "jQuery ist eine sehr berühmte Bibliothek. Sie ist heutzutage schon fast Standart.",
                        "Dojo": "Dojo is ein sehr grosses Framework mit Unterstüzung für vieles, z.B Ui, Parsen, Verarbeiten, Ajax und so weiter. 12Mb mit sehr erweitertem Zeug!",
                        "Letleaf":"Diese Bibliothek ist sehr neu für mich. Sie ist perfekt, um google-ähnliche Karten (zumindest Zoom und Pois) darzustellen, basiert jedoch auf dem Openstreetmapprojekt.Ich bevorzuge dieses Kartenmaterial, da es frei und oftmals detailierter ist."
                    }
                }
            }
        }
    }