{
    "index": {
        "title": "Linklist, about site and projects",
        "preword": "This is the linklist, or alternative home. Sitemap would may be a good name, but you will find 'external' links too. <br /> It contains also a description about the website and me in context to my projects.",
        "description": "<h4><a class='anchor' name='website'></a>Website</h4>This Website is using your Webstorage, if your browser supports this feature. You will reconize this, when you change the language - you have to click the refresh-button after you use the language-button to reload the language-file. This website is really fresh by technics and i like to stay current here, to learn something more about the new HTML5-World. Javascript is also a quite new language for me and a interessting world. It's not a example for a 'secure language', but its was always nice eyecandy and get often usefull in this time (see <a href='http://dev.thoeni.me/peta/plugin.php?plugin=32'>Cardplugin in Peta</a> and also in HTML5). <br />On the other site, i like more serious and mostly <a href='http://en.wikipedia.org/wiki/Model–view–controller'>MVC</a> and <a href='http://en.wikipedia.org/wiki/Object-oriented_programming'>objectoriented Code</a>. On this site, you become a overview of the projects, which where created out of my personal development.<span style='color: grey;'><h4><a class='anchor' name='security'></a>Chapter Security/Protect Websites</h4>PHP 5 & MySQL 4 - Der leichte Einstieg ('the easy entry'), Site 309 (it's a german book, translation by me):<br />'Ask by random just for some chars of the password - one time the first and third, another time the sixt and fourth char.' More on bottom: 'If you integrate this additional features, you're similiar secure as online-bankingsystems are'</span><hr /> Logic! No, seriously, security is a important topic, on which you should have two eyes focused. Two of my projects got a local encryption. The others will follow. In PHP i've to figure out a solution, i will do this, when i find time and space for this. It will be similiar implemented as in python. <h4><a class='anchor' name='about'></a>About me</h4>The last part is <a href='index.html?s=\"about\"' onclick='changeContent(\"about\"); return false;'>about me</a>. After my education, i worked mostly by body, because 4 years, 8 hours a day computerstuff was too much for me. Because i've got a workeraccidant (middlefoot broken), i would like to do my momentary hobby to a job again. Since april, i'm really activ again on <a href='https://github.com/skamster>Github</a>. <br />Those projects show, how i can developing software. <br /> You could use those projects free (<a href='gpl-2.0.txt>Gpl v2</a>) and i'm happy, when people participate (using, commiting, forking, reporting, auditing).",
        "content": {
            "tryToxic": {
                "pLink": "tryToxic",
                "sLink": "https://github.com/skamster/tryToxics/",
                "dLink": "tryToxicDocs/index.html",
                "stable": "Unstable (API changes very fast, since heavy development in core)"
            },
            "jobManagement": {
                "pLink": "jobManagement",
                "sLink": "https://github.com/skamster/jobManagement/",
                "dLink": "jobManagementDocs/index.html",
                "stable": "Basicly stable, paused"
            },
            "Peta": {
                "pLink": "peta",
                "sLink": "https://github.com/skamster/Peta/",
                "dLink": "petaDocs/index.html",
                "stable": "Need some features to finish, but basicly stable"
            },
            "MultiSms": {
                "pLink": "multisms",
                "sLink": "https://github.com/skamster/MultiSms/",
                "dLink": "petaDocs/index.html",
                "stable": "Doesn't work atm, need a rewrite from python 2.7 to 3.x"
            },
            "skamster.github.io": {
                "pLink": "index.html?s=skamster.github.io",
                "sLink": "https://github.com/skamster/skamster.github.io/",
                "dLink": "https://github.com/skamster/skamster.github.io/",
                "stable": "Near finish, have to correcting Text now."
            }

        }
    },
    "tryToxic": {
        "title": "tryToxic",
        "preword": "tryToxic is just another tox-api-client, written in python 3 and pyQt",
        "description": "The history of tryToxic is a short one - there was a binding to tox in python and my interesst was big enough. So first parts where created into <a href='index.html?s=jobManagement'>jobManagement</a>, called toxTry. It's now proper separeted, and got it's name cause it never will be a official client (instead, it's QtTox, written in C++). What to say further? It's easy designed, you should get a overview quick..",
        "features": {
            "Local encryption": "Local data could be encrypted. There are 8 diffrent algorithms to choose and the migration to other algorithms works flowing.",
            "Groupchats": "Invite people into groupchats and even create own ones.",
            "Set Loglevel": "Change the level in runtime.",
            "i18n": "It's prepared for every language and already translated to german and english!"
        },
        "bugs": {
            "Filetransfer": "Sending fails, while recive is working",
            "Local encryption (API)": "The encryption for the local storage from \"Project tox-core\" gets splitted into a seperate lib which isn't avaible to python yet. Because of i want to provide encryption for local data, i work on two new methods to de- and encrypt all kind of files, what makes the project independend in this point. Look into wiki, http://piratepad.net/fileEncryption (posted in diaspora) and the file lib/cryptClass.py for changes and join, if you like to (for auditing, development, forking or using, when it works). If the methods from the tox-core-project gets avaible again, they could be activated too, as a hardening. I also will not remove the sql-data-based encryption, so you will be able to choose at least two algorithms (nice thing would be to increase the algorithms to combined algorithms on both kinds of encryption). "
        },
        "pictures": {
            "initview": {
                "desc": "Initview",
                "src": "images/tryToxicInit.png",
                "link": "images/tryToxicInit.png"
            },
            "detailcompanyview": {
                "desc": "Chatview in german",
                "src": "images/tryToxicChat.png",
                "link": "images/tryToxicChat.png"
            }
        }
    },
    "jobManagement": {
        "title": "jobManagement",
        "preword": "Semantic job-overview when you work diffrent companys (freelance/temporary worker). Written in python3 using pyQt and pyCrypto.",
        "description": "As i begann to work as stagehand, there was often a untrusty atmosphere to the companys. So i came to the idea to do a finance-system to check my companys payings. I'm not a big finance-head, but it was and still is good useable. It's definently not designed for classic finance management!",
        "features": {
            "Local encryption": "Local data could be encrypted. There are 8 diffrent algorithms to choose and the migration to other algorithms works flowing.",
            "Diffrent companys": "The application is optimised to get diffrent companys with endless jobs.",
            "Set Loglevel": "Change the loglevel in runtime.",
            "i18n": "It's prepared for every language and already translated to german and english!"
        },
        "bugs": {
            "Generating charts": "The graphic-chart could be more optimised. It is very unflexible.",
            "Others": "Not detected yet."
        },
        "pictures": {
            "initview": {
                "desc": "Initview",
                "src": "images/jobManagementDataInit.png",
                "link": "images/jobManagementDataInit.png"
            },
            "detailcompanyview": {
                "desc": "Companyview",
                "src": "images/jobManagementDetailComapnyView.png",
                "link": "images/jobManagementDetailComapnyView.png"
            }
        }
    },
    "multisms": {
        "title": "MultiSms",
        "description": "The name MultiSms is to retain from it's originalname, Multimobile(widget). The idea is, to send sms over diffrent providers. The script automate steps the users has to do on a website which offers free sms. It also checks for successful sending (depend on plugin).",
        "preword": "The Project is very old (29.11.2008) and was my second pythonapplication. It use pyKde4 and python2.",
        "features": {
            "Pluginsystem": "The application is able to load several providers via it's pluginsystem.",
            "Widget": "The project offers a widget for the KDE-Interface."
        },
        "bugs": {
            "Everything!": "Need a complete rewrite to python3."
        },
        "pictures": {}
    },
    "peta": {
        "title": "Peta",
        "description": "The name Peta came out of PHPMeta. It’s basicly written in PHP with the use of smarty (template/.tpl-files) and dojo (Javascript). The idea behind this project is to avoid redundant rewrites. A maingoal is a good structure, where the administrator of a system could change things as he need. It's target is a base for everything.",
        "preword": "I think every webmaster know this a little bit - when you want to have a really nice system, then you have to use systemS (multiple wordpresses for example). When you have to fix something then, you have to do this on every single instance/installation. My idea is, to avoid those redundant stuff - basicly you could do a blog, gallery or whatelse, separeted, but same code, for family, friends and publics.. or all the same in one time!",
        "features": {
            "Usermanagement": "A rightsystem, login, etc. One user could have one to n instances",
            "Flexible pluginsystem": "Every plugin could have one to n instances",
            "Flexible accesssystem": "Every user have one to n roles. Every instanced plugin has one to n roles with a r/rw/admin-right.",
            "MVC-Structure": "It's easy to learn the code or write a plugin, since there's a separation between model, view and controller.",
            "Plugins": "<ul><li><a href='https://github.com/skamster/Peta/tree/master/plugins/osmapPlugin'>osmapPlugin</a>|<a href='http://www.openstreetmap.org'>openstreetmap</a>'s with POI-support</li><li><a href='https://github.com/skamster/Peta/tree/master/plugins/markdownSite'>mdSite</a>|<a href='https://en.wikipedia.org/wiki/Markdown'>markDown-Websites</a></li><li><a href='https://github.com/skamster/Peta/blob/master/plugins/site/site.php'>site</a>|html-Websites</li><li><a href='https://github.com/skamster/Peta/blob/master/plugins/forum/forum.php'>forum</a>|Tree-like forum</li><li>Some simple examples..</li></ul>",
            "Livedemo": "<a href='http://dev.thoeni.me/peta'>PETA LIVEDEMO</a>"
        },
        "bugs": {
            "Update on Accessrights on Plugins": "The seting fails. Solution: Remove role from plugin and add with whished Rights again.",
            "Others": "undetected"
        },
        "pictures": {}
    },
    "skamster.github.io": {
        "title": "skamster.github.io",
        "preword": "This website informs about current projects and about me. Style isn't my strongest part, but it should looking acceptable.",
        "description": "A technical demo, descriptions, links and pictures, nice collected and marked up. This is the idea of this website. If this would be a clientwebsite or on a project, i would never use that much effects. But here, it's for playing in use. By the way, the most of this effects is wrote in CSS 3.",
        "features": {
            "Offlinestoring": "This site use your HTML5-offlinestorage, so that you can reload this site or also reenter it after closing the browser and dont have a internetconnection. Try it out!",
            "JSON-Dataquery": "All data gets loaded by static JSON. This is for translation.",
            "jQuery": "jQuery is for loading stuff, animate and finding of classes",
            "Diffrent styles": "You could choose a alternative style by View->website-style"
        },
        "bugs": {
            "onTop-Button in Chrome and Opera": "The button wont move in chrome. Works well in firefox."
        },
        "pictures": {}
    },
    "about": {
        "title": "About me",
        "preword": "Some information over me",
        "description": "Hello,<br />This part informs you about my expiriences and also a little about my personal life. I tried many things and detect my strong parts in programming and in administration/support of systems. On the other site, i wouldn't say i'm a designer or hardware-specialist. <br /> Following, you will find a list with my expiriences - more personal information like the education-passport you will find <a href='https://cloud.openmailbox.org/public.php?service=files&t=c514d2742dd7e8b05fa857986984131d'>in this link</a>. The password will be sendet with a bid or on question.",
        "picture": "profile.png",
        "contact": {
            "Xampp": "skamster@jabber.ccc.de",
            "E-Mail": "hersche@openmailbox.org",
            "Diaspora": "<a href='https://nerdpol.ch/u/hersche'>hersche@nerdpol.ch</a>",
            "Xing": "<a href='https://www.xing.com/profile/Vinzenz_Hersche'>Vinzenz Hersche</a>"
        },
        "hobbys": {
            "trans": "Other interessts",
            "Longboards": "I drive longboards since 9 years now. It's my best bycicle-replacement.<br /><a style='display: inline;' class='gallerybox' data-fancybox-group='gallery' href='images/board.jpg' title='Boards beside the Aare, Berne 2014' ><img src='images/board.jpg' style='width: 60%;'/></a>",
            "Bycicle": "The bycicle is a great base for traveling. I like to do that international.",
            "12v-systems": "I have my own electricity full on 12 volt and a solar-panel as power-supplier. I didn't need a converter to 230v at all!",
            "Wood": "Wood is a nice material for working with. I would like to got by the way deeper into that topic."
        },
        "oldjobs": {
            "trans": "Jobs between Education and now",
            "description": "As i ended my education, i wanted to do something else than sitting before a screen. I found jobs in the topic of stage-buildings for huge openairs and concerts.<br /><div class='gallerytablediv'><table class='gallerytable'><tr><td><a class='gallerybox' data-fancybox-group='gallery' href='images/oldjob1.jpg' title='Build up of the mainstage @Paleo, Nyon 2012' ><img src='images/oldjob1.jpg'></img></a></td><td><a class='gallerybox' data-fancybox-group='gallery' href='images/oldjob2.jpg' title='Builded up Mainstage @Paléo in Nyon, 2012' ><img src='images/oldjob2.jpg' ></img></a></td></tr></table></div><br />I was on the stage with Nine inch nails for moving the LEDs. I was building the Stage for Muse and also Robbie Williams. Also when i'm not a fan of those artists directly, it's interessting to see this world too.<br /><div class='gallerytablediv'><table class='gallerytable'><tr> <td><a class='gallerybox' data-fancybox-group='gallery' href='images/oldjob6.jpg' title='Build up the Redbull crushed Ice, 2012 Lausanne' ><img src='images/oldjob6.jpg'></img></a></td><td><a class='gallerybox' data-fancybox-group='gallery' href='images/oldjob3.jpg' title='Build up the stage for Muse, Stadte de Suisse Bern, 2013' ><img src='images/oldjob3.jpg' /></a></td><td><a class='gallerybox' data-fancybox-group='gallery' href='images/oldjob4.jpg' title='Muse in action (Backstageview), Stadte de suisse, Bern 2013' ><img src='images/oldjob4.jpg' ></img></a></td><td><a class='gallerybox' data-fancybox-group='gallery' href='images/oldjob5.jpg' title='PuBligg-Tour Luzern, 2014' ><img src='images/oldjob5.jpg'></img></a></td></td><td><a class='gallerybox' data-fancybox-group='gallery' href='images/oldjob7.jpg' title='Light and Stagetest on swiss music awards 2014, Zürich' ><img src='images/oldjob7.jpg'></img></a></td><td><a class='gallerybox' data-fancybox-group='gallery' href='images/oldjob8.jpg' title='Mobile stage @streetparade, Zürich 2012' ><img src='images/oldjob8.jpg'></img></a></td></tr></table></div>"

        },
        "support": {
            "trans": "Suport references",
            "desc": "I support diffrent people's computers since more than 6 years in assistance with linux. Mostly i use a <a href='http://kubuntu.org'>Kubuntu</a>, sometimes also Linuxmint, but near ever i use <a href='http://kde.org'>KDE</a>",
            "reference": {
                "Puzzle ITC": "My <a href='http://puzzle.ch'>Educationcompany</a> wrote over me (translated): <h4>Expertise</h4>Thanks to his good grasp and thirst of knowledge, mr Hersche was fast able to work in diffrent topics and get today etablished expertise. He handles problems autonomus and does a good solution.<h4>Method expertise</h4>Mr Hersche worked out of beginn very autonomous and planned. To do this, he used diffrent workingtechniques and choose with help of his cross-linked thinking the most efficience method.",
                "ex-Name": "Usage of person",
                "name 2": "another ussage"
            }
        },
        "languages": {
            "trans": "Languages",
            "PHP": {
                "desc": "Use this language for about 10 years. Since <a href='http://en.wikipedia.org/wiki/Object-oriented_programming'>OOP</a> is default with PHP 5, it's beautiful to use. Before it was horrible, but not for me (i didn't know <a href='http://en.wikipedia.org/wiki/Object-oriented_programming'>OOP</a> in the beginning).",
                "frameworks": {
                    "Smarty": "A templateframework, that allow a clean separation between 'controller' and 'view'. <a href='http://smarty.net'>Smarty</a> make <a href='https://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller'>MVC</a> in PHP really easy!"
                }
            },
            "Python": {
                "desc": "I know <a href='https://python.org'>python</a> since 5 years and it addict me really fast. Perfect possibilitys of sequentell, <a href='http://en.wikipedia.org/wiki/Object-oriented_programming'>OOP</a> and modulare code. It also don't use { }, but forces you to format your code proper. Top!",
                "frameworks": {
                    "Urllib2": "<a href='https://docs.python.org/2/library/urllib2.html'>This</a> is a nice framwork to 'speak' with websites, which doesn't get a daemon. Just go to a field, put input in and submit - in python, not in browser. That way you could do a lot automatic, unimportant the hoster like it or not",
                    "PyQt || PyKde": "<a href='http://qt-project.org/'>Qt</a> is a very modular <a href='http://en.wikipedia.org/wiki/Graphical_user_interface'>GUI</a>-library - it's easy to use and works very stable. PyKde was one of the first frameworks i used.",
                    "PyTox": "PyTox is a interface to the tox-core-project. The whole project is in heavy development. For further information visit <a href='http://tox.im'>tox.im</a>.",
                    "PyCrypto": "<a href='https://www.dlitz.net/software/pycrypto/'>PyCrypto</a> supports many kinds of hashing, symmetric and asymmetric encryptions. My focus is on symmetric encryptions. I use it for the encryption of local data."
                }
            },
            "Java": {
                "desc": "Learned this language in my education. The JVM contains a very big, own framework, what i didn't really like (JVM gets slow out of this). It's strictly needed <a href='http://en.wikipedia.org/wiki/Object-oriented_programming'>OOP</a>, what was nice to learn this kind of programming. Because android grows very much and <a href='https://en.wikipedia.org/wiki/Dalvik_%28software%29'>dalvik</a> is very optimized, this language is looking attractive again.",
                "frameworks": {
                    "Groovy & grails": "Similiar to <a href='http://en.wikipedia.org/wiki/Ruby_on_Rails'>Ruby on rails</a>. <a href='https://en.wikipedia.org/wiki/Groovy_%28programming_language%29'>Groovy</a> is a more simple language and <a href='https://en.wikipedia.org/wiki/Grails_%28framework%29'>grails</a> is a great framework! Both are based on Java, what allows to use java-classes withouth problems."
                }
            },
            "Javascript": {
                "desc": "In past (10-12 years), this language was a example why you should do mostly pure html (maybe good for detecting the user's language, but nothing like ajax or forms out of js) sites. So much incompatibility between browsers and security-issues! Today, this changed, a lot of stuff is default, there are mighty js-frameworks and there came <a href='http://www.w3schools.com/html/html5_intro.asp'>Html 5</a> which use js in combination. Look the source of this page ;)",
                "frameworks": {
                    "jQuery": "<a href='http://jquery.com/'>jQuery</a> is very famous library. Today it's nearly a defacto-default.",
                    "Dojo": "<a href='http://dojotoolkit.org/'>Dojo</a> is a very large framework with support for many many things, such as ui, parsing, processing, ajax, etc. 12mb of very advanced stuff!",
                    "Leaflet": "<a href='http://leafletjs.com/'>This library</a> is very new for me. It is perfect for google-like maps (at least zoom and mark pois), but based on the openstreetmap-project. I really preferr the tiles from osm, cause they're free and often more detailed."
                }
            }
        },
        "mobile": {
            "trans": "Mobile hacking",
            "dd-wrt": "Used on some Siemens and Lynksys-routers",
            "Archos AV100": "I've rooted this old <a href='http://www.gofurygo.de/av100.php'>'multimedia'-player</a> with <a href='http://sourceforge.net/projects/linav/'>MediOS</a>.",
            "GTA02/Openmoko": "<a href='http://en.wikipedia.org/wiki/Neo_FreeRunner'>My first Smartphone</a> (400Mhz). I used it for 3, relative unstable, years (so i love the much more stable Androids). In the end, there where two active Projects. First, <a href='http://shr-project.org/trac'>SHR</a>  (stable hybrid release) which used the <a href='http://en.wikipedia.org/wiki/Enlightenment_%28software%29'>E17-Windowmanager</a>. I wrote <a href='https://gist.github.com/skamster/10565527'>my first gtk-python-application</a> there.<br />On the other site, what i used - <a href='http://qtmoko.sourceforge.net/'>QtMoko</a> which was really stable and fast (cause it doesn't needed a Xorg-server). <br /><a href='http://qt-project.org/'>Qt</a> is ql! <br />Now the project gets a hardwareupgrade since some years, it's called <a href='http://projects.goldelico.com/p/gta04-main/'>GTA04</a> and is continued by another company.",
            "Sony Xperia": "Because of money (i still would like a GTA04) i buyed a <a href='http://en.wikipedia.org/wiki/Sony_Ericsson_Xperia_active'>Xperia Active</a> after the GSM-modem was fail for doing it's work. The new one was <a href='http://en.wikipedia.org/wiki/IP_Code'>IP</a>67-'secured' with 600Mhz improved processor (1Ghz Singlecore) - nice! Easy to root, i also did this for some friends. The first expirience with <a href='http://www.xda-developers.com/'>xda</a>. After not a year, i couldn't do a phone anymore - the quality was too bad, no matter which rom.",
            "Motorola": "After my Xperia i go back to 600Mhz, a cheap Motorola 'outdoor' Phone, <a href='http://www.gsmarena.com/motorola_defy_mini_xt320-4375.php'>X320</a>. This is still <a href='http://forum.xda-developers.com/showthread.php?t=2079202'>rootable</a> by flashing a spain firmware until bootloader is installed (TWRP, i think) and plug out after that step (before install your whished rom). Nice, because recoverable. After the screen gets broken, i get some gifts in short time - two HTC's",
            "HTC": "I became my two HTC's for free, as a gift from friends. One is a <a href='http://forum.xda-developers.com/htc-sensation/'>Sensation</a> (Dualcore, 1.2 Ghz), the other a <a href='http://forum.xda-developers.com/htc-one-x'>One X</a> (Quadcore, 1.5Ghz). This is a massive performance-improvement for me! The One X is faster than my Laptop (2x1.86Ghz vs. the 4x1.5)! Nice for testing stuff, being up to date but secured. Rooting is still easy through a official way.",
            "Samsung": "Some friends get some Samsung Galaxy S4 and also the mini-version. I was allowed to root the mini, what also works easy in a official way.",
            "IPhone": "I did this for a friend's IPhone 4S. Replaced a screen (success), next time a speaker.",
            "Sony PSP (very old 2000-Serie)": "I became this as a gift for the iphone-repairment. Updated (6.60) and flashed with permanently homebrew, like it should be! Very nice for NEOGEO-Games (as a child i loved 'Metal-Slug'!), but it plays PSP-ISO's as usual discs. Nice!"
        },
        "sys": {
            "trans": "Sysadmin-Expiriences",
            "Windows 3.1": "My first computer with 20Mb-Harddisk and 20 floppys to setup windows. It was also the first computer which i do into single parts and to a computer again. This was with nine years.",
            "Windows 98-Xp": "My following computers. From my first 4x-Cddrive to my first disc-burner. I learned and tried a lot of stuff there, but the expirience wans't always good.",
            "Mandrivia Linux": "This was my first linux i really used. Was a little like <a href='http://kubuntu.org'>Kubuntu</a> today.",
            "OpenSuse": "As this project getting started, it looks interessting (cause of simpleness) - but personaly, i've too much failures there. Today, this may changed, didn't use it again",
            "Gentoo": "After playing a little with linux, dualboots and that stuff, i tried <a href='https://en.wikipedia.org/wiki/Gentoo_Linux'>gentoo</a>. This was short before my education. In the education, a teacher was a gentoo-user too, and i was allowed to have a gentoo-installation as default (while other didn't pass they're kernel-panics, but they also felt lucky when they where back in Win Xp ;) ). This is my favourite distro!",
            "Fedora": "In my company, we used basicly fedora. I didn't really liked that, so i've changed to gentoo.",
            "Kubuntu": "Because of <a href='https://en.wikipedia.org/wiki/Gentoo_Linux'>gentoo</a> was too unstable (mh, with unstable repos and play arounds), i've changed to kubuntu. Kubuntu, because i use <a href='https://en.wikipedia.org/wiki/KDE'>KDE</a> since version 3. With this distro i support a lot of computer users which like to change to linux",
            "CentOS": "For the servers in our company, we've used CentOS. Basicly i've learned development, but i was able to work some weeks by the Webadmin-dudes. We also got a 'play-around'-server for each worker, which used this system too. Those got 512MB of RAM. My services where: ",
            "centossub": {
                "XMPP/Jabber": "<a href='https://en.wikipedia.org/wiki/Openfire'>Openfire</a>, a java-based <a href='https://en.wikipedia.org/wiki/XMPP'>Jabberserver</a>. Because of it's RAM-ussage i've changed to <a href='https://en.wikipedia.org/wiki/Ejabberd'>Ejabberd</a> after a while",
                "E-Mail": "<a href='https://en.wikipedia.org/wiki/Sendmail'>Sendmail</a> and <a href='https://en.wikipedia.org/wiki/Dovecot_%28software%29>dovecot</a>. As some sys-admins say: Setup sendmail once, and it's nice. Set it up more and you're a crazy.",
                "Tor-Node": "A simple node in the <a href='https://en.wikipedia.org/wiki/Tor_%28anonymity_network%29'>tor-anonymizing-network</a>",
                "Apache": "A <a href='https://en.wikipedia.org/wiki/Apache_HTTP_Server'>webserver</a>, configured for ruby & rails and php-support.",
                "Squid": "<a href='http://en.wikipedia.org/wiki/Squid'>Squid</a> is a cache-proxy-server",
                "MySQL": "A really default database",
                "Diaspora": "This is a <a href='https://en.wikipedia.org/wiki/Diaspora_%28software%29'>social-network</a> which works similiar to E-Mail (P2P). It was running over Apache (<a href='http://rubyonrails.org/'>RoR</a>). Since i have issues with self-signed certificates and not always time, it was still unstable",
                "Seeks": "A <a href='https://en.wikipedia.org/wiki/Seeks'>P2P-Searchengine</a> for getting results from google, stackoverflow, duckduckgo, wikipedia or whatever else. Today, there's also a fork called <a href='https://github.com/asciimoo/searx'>searx</a>."
            },
            "Debian": "I've used <a href='https://en.wikipedia.org/wiki/Debian'>Debian</a> for my second server, which i've for about a year. <a href='https://en.wikipedia.org/wiki/Debian'>Debian</a> is also the base for <a href='http://qtmoko.sourceforge.net/'>QtMoko</a> (see Mobile hacks/Openmoko) It's a really often used system and base for a lot of distros. I know apt-get better by using kubuntu than debian.",
            "Sabayon": "This is my currently favourite-looking distro. It's based on gentoo, but using precompiled packages (which are compiled by gentoo-repos). It default-desktop is KDE and it's rolling-release. Yay!"

        }
    },
    "transl": {
        "features": "Features",
        "bugs": "Bugs",
        "pictures": "Pictures",
        "description": "Description",
        "stability": "Stability",
        "projectname": "Projectname",
        "source": "Sourcecode",
        "doc": "Docs",
        "table": "Linktable",
        "refresh": "Refresh",
        "nowebstorage": "You don't have webstoragesupport",
        "fromstorage": "from Webstorage",
        "fromnew": "reloaded right now!",
        "timeline": "<p>Those are my expiriences which you also view look as a <a id='timeline' href='#my-timeline' onclick='$(\"#my-timeline\").show()'>timeline</a>.</p>",
        "lang": "en",
        "expiriences": "Expiriences",
        "security": "Security",
        "about": "About me",
        "mobilephonehint": "Your Browser looks to running on a mobile device - rotate your device to the landscape-mode to enjoy the website optimised."
    }
}